<a href="https://colab.research.google.com/github/TurboLukas/MyResume/blob/master/CheatSheet.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# MY PANDAS CHEAT SHEET

In [0]:
import pandas as pd
import numpy as np

In [0]:
df = pd.read_csv("https://data.heatonresearch.com/data/t81-558/auto-mpg.csv")

### DISPLAYING VALUES & DESCRIBING SET

In [59]:
display(df.head())

    mpg  cylinders  displacement  ... year  origin                       name
0  18.0          8         307.0  ...   70       1  chevrolet chevelle malibu
1  15.0          8         350.0  ...   70       1          buick skylark 320
2  18.0          8         318.0  ...   70       1         plymouth satellite
3  16.0          8         304.0  ...   70       1              amc rebel sst
4  17.0          8         302.0  ...   70       1                ford torino

[5 rows x 9 columns]

In [62]:
df.columns.values

array(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'year', 'origin', 'name'], dtype=object)

In [11]:
df.select_dtypes(include = ['int','float'], exclude = 'bool').head()

    mpg  cylinders  displacement  weight  acceleration  year  origin
0  18.0          8         307.0    3504          12.0    70       1
1  15.0          8         350.0    3693          11.5    70       1
2  18.0          8         318.0    3436          11.0    70       1
3  16.0          8         304.0    3433          12.0    70       1
4  17.0          8         302.0    3449          10.5    70       1

In [0]:
def col_summary(df):
  
  df = df.select_dtypes(include=['int', 'float'])
  headers = df.columns.values
  summary = []
  for field in headers:
    summary.append(
        {
            'aname': field,
            'mean':df[field].mean(),
            'median':df[field].median(),
            'sdev':df[field].std(),
            'var': df[field].var()
        }) 
  
  return summary

In [61]:
col_summary(df)

[{'aname': 'mpg',
  'mean': 23.514572864321615,
  'median': 23.0,
  'sdev': 7.815984312565782,
  'var': 61.089610774274405},
 {'aname': 'cylinders',
  'mean': 5.454773869346734,
  'median': 4.0,
  'sdev': 1.7010042445332094,
  'var': 2.8934154399199943},
 {'aname': 'displacement',
  'mean': 193.42587939698493,
  'median': 148.5,
  'sdev': 104.26983817119581,
  'var': 10872.199152247364},
 {'aname': 'weight',
  'mean': 2970.424623115578,
  'median': 2803.5,
  'sdev': 846.8417741973271,
  'var': 717140.9905256768},
 {'aname': 'acceleration',
  'mean': 15.568090452261291,
  'median': 15.5,
  'sdev': 2.7576889298126757,
  'var': 7.604848233611381},
 {'aname': 'year',
  'mean': 76.01005025125629,
  'median': 76.0,
  'sdev': 3.697626646732623,
  'var': 13.672442818627143},
 {'aname': 'origin',
  'mean': 1.5728643216080402,
  'median': 1.0,
  'sdev': 0.8020548777266163,
  'var': 0.6432920268850575}]

In [106]:
df2 = pd.DataFrame(col_summary(df))
display(df2)

          aname         mean  median        sdev            var
0           mpg    23.514573    23.0    7.815984      61.089611
1     cylinders     5.454774     4.0    1.701004       2.893415
2  displacement   193.425879   148.5  104.269838   10872.199152
3    horsepower   104.469388    93.5   38.491160    1481.569393
4        weight  2970.424623  2803.5  846.841774  717140.990526
5  acceleration    15.568090    15.5    2.757689       7.604848
6          year    76.010050    76.0    3.697627      13.672443
7        origin     1.572864     1.0    0.802055       0.643292

          aname         mean  median        sdev            var
0           mpg    23.514573    23.0    7.815984      61.089611
1     cylinders     5.454774     4.0    1.701004       2.893415
2  displacement   193.425879   148.5  104.269838   10872.199152
3    horsepower   104.469388    93.5   38.491160    1481.569393
4        weight  2970.424623  2803.5  846.841774  717140.990526
5  acceleration    15.568090    15.5    2.757689       7.604848
6          year    76.010050    76.0    3.697627      13.672443
7        origin     1.572864     1.0    0.802055       0.643292

In [32]:
df.describe()

              mpg   cylinders  ...        year      origin
count  398.000000  398.000000  ...  398.000000  398.000000
mean    23.514573    5.454774  ...   76.010050    1.572864
std      7.815984    1.701004  ...    3.697627    0.802055
min      9.000000    3.000000  ...   70.000000    1.000000
25%     17.500000    4.000000  ...   73.000000    1.000000
50%     23.000000    4.000000  ...   76.000000    1.000000
75%     29.000000    8.000000  ...   79.000000    2.000000
max     46.600000    8.000000  ...   82.000000    3.000000

[8 rows x 7 columns]

INDEXING

In [85]:
df[['mpg','year']]

      mpg  year
0    18.0    70
1    15.0    70
2    18.0    70
3    16.0    70
4    17.0    70
..    ...   ...
393  27.0    82
394  44.0    82
395  32.0    82
396  28.0    82
397  31.0    82

[398 rows x 2 columns]

In [93]:
df[df['year']>20]

ERROR! Session/line number was not unique in database. History logging moved to new session 63

      mpg  cylinders  displacement  ... year  origin                       name
0    18.0          8         307.0  ...   70       1  chevrolet chevelle malibu
1    15.0          8         350.0  ...   70       1          buick skylark 320
2    18.0          8         318.0  ...   70       1         plymouth satellite
3    16.0          8         304.0  ...   70       1              amc rebel sst
4    17.0          8         302.0  ...   70       1                ford torino
..    ...        ...           ...  ...  ...     ...                        ...
393  27.0          4         140.0  ...   82       1            ford mustang gl
394  44.0          4          97.0  ...   82       2                  vw pickup
395  32.0          4         135.0  ...   82       1              dodge rampage
396  28.0          4         120.0  ...   82       1                ford ranger
397  31.0          4         119.0  ...   82       1                 chevy s-10

[398 rows x 9 columns]

### MISSING VALUES

In [0]:
df = pd.read_csv("https://data.heatonresearch.com/data/t81-558/auto-mpg.csv", na_values=['NA','NaN', '?'])

In [80]:
pd.isnull(df['horsepower']).values.any()

True

In [0]:
df['horsepower'] = df['horsepower'].fillna(df['horsepower'].median())

In [0]:
df = df.dropna()

In [0]:
def remove_outliers(df, name, std_patiance):
    
    return df

In [0]:
df = remove_outliers(df,'horsepower', 2)

In [0]:
def remove_outliers(df, std_patiance=2):
  names = df.select_dtypes(include=['int', 'float']).columns.values
  for name in names:
    std = df[name].std()
    mean = df[name].mean()
    rows_to_drop = df.index[np.abs((df[name] - mean) >= (std_patiance * std))]
    df.drop(rows_to_drop, axis=0, inplace=True)

  return df

In [157]:
df = remove_outliers(df)
df.describe()

              mpg   cylinders  ...        year      origin
count  335.000000  335.000000  ...  335.000000  335.000000
mean    24.189851    5.208955  ...   76.331343    1.617910
std      6.814182    1.564361  ...    3.672287    0.824571
min     13.000000    3.000000  ...   70.000000    1.000000
25%     18.500000    4.000000  ...   73.000000    1.000000
50%     24.000000    4.000000  ...   76.000000    1.000000
75%     29.500000    6.000000  ...   79.000000    2.000000
max     39.100000    8.000000  ...   82.000000    3.000000

[8 rows x 8 columns]

In [161]:
remove_na(df)
df.describe()

              mpg   cylinders  ...        year      origin
count  335.000000  335.000000  ...  335.000000  335.000000
mean    24.189851    5.208955  ...   76.331343    1.617910
std      6.814182    1.564361  ...    3.672287    0.824571
min     13.000000    3.000000  ...   70.000000    1.000000
25%     18.500000    4.000000  ...   73.000000    1.000000
50%     24.000000    4.000000  ...   76.000000    1.000000
75%     29.500000    6.000000  ...   79.000000    2.000000
max     39.100000    8.000000  ...   82.000000    3.000000

[8 rows x 8 columns]

### MERGING, CONCATENATING & INDEXING

In [164]:
horsepower = df['horsepower']
year = df[['year', 'name']]
result = pd.concat([horsepower, year], axis=1)
display(result)

    horsepower  year                       name
0          130    70  chevrolet chevelle malibu
1          165    70          buick skylark 320
2          150    70         plymouth satellite
3          150    70              amc rebel sst
4          140    70                ford torino
..         ...   ...                        ...
393         86    82            ford mustang gl
394         52    82                  vw pickup
395         84    82              dodge rampage
396         79    82                ford ranger
397         82    82                 chevy s-10

[398 rows x 3 columns]

In [167]:
k = pd.concat([df[4:90],df[396:]], axis=0)
display(k)

      mpg  cylinders  displacement  ... year  origin                  name
4    17.0          8         302.0  ...   70       1           ford torino
5    15.0          8         429.0  ...   70       1      ford galaxie 500
6    14.0          8         454.0  ...   70       1      chevrolet impala
7    14.0          8         440.0  ...   70       1     plymouth fury iii
8    14.0          8         455.0  ...   70       1      pontiac catalina
..    ...        ...           ...  ...  ...     ...                   ...
87   13.0          8         350.0  ...   73       1      chevrolet malibu
88   14.0          8         302.0  ...   73       1      ford gran torino
89   15.0          8         318.0  ...   73       1  dodge coronet custom
396  28.0          4         120.0  ...   82       1           ford ranger
397  31.0          4         119.0  ...   82       1            chevy s-10

[88 rows x 9 columns]

In [169]:
#bad df['year':'name'] use:_ instead
df.loc[:,'year':'name']

     year  origin                       name
0      70       1  chevrolet chevelle malibu
1      70       1          buick skylark 320
2      70       1         plymouth satellite
3      70       1              amc rebel sst
4      70       1                ford torino
..    ...     ...                        ...
393    82       1            ford mustang gl
394    82       2                  vw pickup
395    82       1              dodge rampage
396    82       1                ford ranger
397    82       1                 chevy s-10

[398 rows x 3 columns]

In [170]:
df.at[200,'name']

'ford granada ghia'

### SAVING

PANDAS TO CSV

In [0]:
df.to_csv('filename', index=False) # index = false to not write row numbers

PANDAS TO PICKLE

In [0]:
#pickle = binary file format

In [0]:
import pickle

In [0]:
with open(filename_write,"wb") as f:
    pickle.dump(df, f)

In [0]:
with open(filename_write,"rb") as f:
    df = pickle.load(f)

OTHER USEFUL FUNCTIONS

In [0]:
pd.read_json()
pd.read_hdf() #best for ANN
pd.read_sql()
pd.read_feather() # best categorical data so far
pd.read_pickle() #another implementation

In [0]:
df.to_feather("filename")

NUMPY ARRAYS

In [0]:
np.save('test.npy', array_u_want_to_save)

In [0]:
your_array = p.load('test.npy')

NEURAL NETWORKS TO HDF5

In [0]:
# HDF5 = Hierarchical Data Format version 5

## PREPROCESSING

###PANDAS

Own validation test and train df

In [172]:
df.index

RangeIndex(start=0, stop=398, step=1)

In [175]:
len(df)

398

In [0]:
df.reindex(np.random.permutation(df.index)) #it's always good idea to shuffle

In [178]:
mask = np.random.rand(len(df)) < 0.75
mask

array([False,  True,  True,  True,  True,  True,  True, False, False,
        True,  True, False,  True,  True,  True, False,  True, False,
       False,  True, False, False, False,  True,  True, False,  True,
        True,  True,  True,  True,  True,  True, False, False, False,
        True, False,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True, False, False,  True,  True,  True, False,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
       False,  True,  True,  True,  True,  True,  True, False,  True,
       False,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True, False, False,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
       False,  True,  True, False,  True,  True,  True,  True, False,
        True, False,  True,  True,  True,  True,  True,  True, False,
        True,  True, False,  True,  True,  True,  True, False,  True,
        True, False,  True,  True,  True, False,  True,  True,  True,
        True, False,  True,  True, False, False,  True, False,  True,
        True,  True,  True, False,  True,  True,  True,  True, False,
        True,  True,  True,  True,  True, False,  True, False,  True,
        True, False,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True, False,  True,  True,  True,  True, False,
        True, False,  True,  True,  True,  True, False,  True,  True,
        True,  True,  True,  True,  True, False,  True,  True,  True,
        True,  True,  True,  True,  True, False,  True,  True, False,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True, False,  True,  True,
        True,  True,  True,  True,  True,  True,  True, False,  True,
        True,  True,  True, False,  True,  True, False, False,  True,
        True,  True,  True,  True, False, False,  True,  True,  True,
       False,  True,  True, False,  True,  True, False,  True,  True,
        True,  True,  True,  True, False, False,  True,  True,  True,
       False,  True, False,  True, False,  True,  True, False,  True,
       False,  True, False,  True,  True,  True,  True,  True,  True,
        True,  True, False,  True, False,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True, False,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True, False,  True,  True, False,
       False,  True, False,  True, False, False, False,  True,  True,
        True,  True, False, False,  True,  True,  True,  True,  True,
        True,  True,  True, False,  True,  True,  True, False,  True,
       False,  True, False,  True, False,  True,  True,  True,  True,
        True,  True, False,  True,  True, False,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True, False,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True, False,  True,  True, False,
        True, False])

In [183]:
train = df[mask]
test = df[~mask]
test.describe()

             mpg  cylinders  displacement  ...  acceleration       year     origin
count  89.000000  89.000000     89.000000  ...     89.000000  89.000000  89.000000
mean   23.750562   5.449438    190.247191  ...     15.513483  75.719101   1.606742
std     8.177326   1.644628    102.694746  ...      2.827591   3.813817   0.806479
min    10.000000   4.000000     71.000000  ...      8.000000  70.000000   1.000000
25%    17.500000   4.000000     98.000000  ...     14.000000  73.000000   1.000000
50%    22.000000   4.000000    146.000000  ...     15.500000  76.000000   1.000000
75%    30.000000   6.000000    250.000000  ...     17.300000  79.000000   2.000000
max    44.600000   8.000000    455.000000  ...     23.700000  82.000000   3.000000

[8 rows x 7 columns]

In [184]:
train.describe()

              mpg   cylinders  ...        year      origin
count  309.000000  309.000000  ...  309.000000  309.000000
mean    23.446602    5.456311  ...   76.093851    1.563107
std      7.721144    1.719503  ...    3.665511    0.801823
min      9.000000    3.000000  ...   70.000000    1.000000
25%     17.500000    4.000000  ...   73.000000    1.000000
50%     23.000000    4.000000  ...   76.000000    1.000000
75%     29.000000    8.000000  ...   79.000000    2.000000
max     46.600000    8.000000  ...   82.000000    3.000000

[8 rows x 7 columns]

### NUMPY

### SK_LEARN

## **READY TO USE FUNCTIONS**

DISPLAYING DATAFRAME

In [0]:
def summary(df):
  """ Usage: summary(df) """
  df = df.select_dtypes(include=['int', 'float'])
  headers = df.columns.values
  summary = []
  for field in headers:
    summary.append(
        {
            'aname': field,
            'mean':df[field].mean(),
            'median':df[field].median(),
            'sdev':df[field].std(),
            'var': df[field].var()
        }) 
  df2 = pd.DataFrame(summary)
  #display(df2)
  return df2

FILLING NA

In [0]:
def remove_na(df):
  cols = df.select_dtypes(include=['int', 'float']).columns.values
  for col in cols:
    if df[col].isnull().values.any():
      df[col] = df[col].fillna(df[col].median())
  df.dropna()
  return df

REMOVING OUTLIERS

In [0]:
def remove_outliers(df, std_patiance=2):
  names = df.select_dtypes(include=['int', 'float']).columns.values
  for name in names:
    std = df[name].std()
    mean = df[name].mean()
    rows_to_drop = df.index[np.abs((df[name] - mean) >= (std_patiance * std))]
    df.drop(rows_to_drop, axis=0, inplace=True)

  return df

### DISPLAYING DATAFRAME

In [68]:
summary(df)

          aname         mean  median        sdev            var
0           mpg    23.514573    23.0    7.815984      61.089611
1     cylinders     5.454774     4.0    1.701004       2.893415
2  displacement   193.425879   148.5  104.269838   10872.199152
3        weight  2970.424623  2803.5  846.841774  717140.990526
4  acceleration    15.568090    15.5    2.757689       7.604848
5          year    76.010050    76.0    3.697627      13.672443
6        origin     1.572864     1.0    0.802055       0.643292